<?php
declare(strict_types=1);
// +----------------------------------------------------------------------
// | CodeEngine
// +----------------------------------------------------------------------
// | Copyright 艾邦
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: TaoGe <liangtao.gz@foxmail.com>
// +----------------------------------------------------------------------
// | Version: 2.0 2021/5/25 11:36
// +----------------------------------------------------------------------

return [
    // 离线消息，即当用户不在线时，下次登录仍会拉取到离线消息
    'offline'           => [
        // 离线消息默认保存7天
        'save_time'  => 60 * 60 * 24 * 7,
        // 对于单聊消息，每个用户的离线消息缓存最多保存100个单聊会话的未读消息，每个单聊会话最多保存100条未读消息。超出限制的部分不会被计入未读计数，但这些消息仍会存到消息漫游中
        'save_limit' => 100,
    ],
    // 漫游消息，即用户更换终端的情况下，也可以获取到跟其他用户或者某个群的聊天记录
    'roaming'           => [
        // 默认情况下，单聊消息和群聊消息有7天漫游，超过漫游时长的消息会被删除。
        'roaming_time' => 60 * 60 * 24 * 7,
    ],
    // 单个用户好友人数上限
    'max_friends_num'   => 300,
    // 单个用户可加入群组数
    'max_groups_num'    => 500,
    // 单个群成员数上限（非直播群）
    'max_members_group' => 200,
];
