<?php
declare(strict_types=1);
// +----------------------------------------------------------------------
// | CodeEngine
// +----------------------------------------------------------------------
// | Copyright 艾邦
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: TaoGe <liangtao.gz@foxmail.com>
// +----------------------------------------------------------------------
// | Version: 2.0 2021/4/23 10:44
// +----------------------------------------------------------------------

namespace app\struct;

use com\enum\Enum;

/**
 * 消息流向
 * @package app\struct
 */
class MsgFlow extends Enum
{
    // in  为收到的消息
    const IN = 0;
    // out 为发出的消息
    const OUT = 1;
}
