<?php
declare(strict_types=1);
// +----------------------------------------------------------------------
// | CodeEngine
// +----------------------------------------------------------------------
// | Copyright 艾邦
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: TaoGe <liangtao.gz@foxmail.com>
// +----------------------------------------------------------------------
// | Version: 2.0 2021/5/26 10:09
// +----------------------------------------------------------------------

namespace app\struct;

use com\enum\Enum;

/**
 * 消息优先级
 * @package app\struct
 */
class MsgPriority extends Enum
{
    // 默认为普通优先级
    const DEFAULT = 0;
    // 高优先级，一般用于礼物等重要消息
    const HIGH = 1;
    // 普通优先级，一般用于普通消息
    const NORMAL = 2;
    // 低优先级，一般用于点赞消息
    const LOW = 3;
}
