<?php
declare(strict_types=1);
// +----------------------------------------------------------------------
// | CodeEngine
// +----------------------------------------------------------------------
// | Copyright 艾邦
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: TaoGe <liangtao.gz@foxmail.com>
// +----------------------------------------------------------------------
// | Version: 2.0 2021/5/26 14:20
// +----------------------------------------------------------------------

namespace app\struct;

use com\enum\Enum;

/**
 * 好友选项
 * @package app\struct
 */
class AllowType extends Enum
{
    // 当被人加好友时：允许任何人添加自己为好友
    const ALLOW_ANY = 0;
    // 当被人加好友时：需要经过自己确认才能添加自己为好友
    const NEED_CONFIRM = 1;
    // 当被人加好友时：不允许任何人添加自己为好友
    const DENY_ANY = 2;
}
