<?php
declare(strict_types=1);
// +----------------------------------------------------------------------
// | CodeEngine
// +----------------------------------------------------------------------
// | Copyright 艾邦
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: TaoGe <liangtao.gz@foxmail.com>
// +----------------------------------------------------------------------
// | Version: 2.0 2021/4/23 10:45
// +----------------------------------------------------------------------

namespace app\struct;

use com\enum\Enum;

/**
 * 群组类型
 * @package app\struct
 */
class GroupType extends Enum
{
    // 群组类型：好友工作群 类似普通微信群，创建后不能自由加入，必须由已经在群的用户邀请入群。
    const GROUP_WORK = 0;
    // 群组类型：公开群 类似 QQ 群，用户申请加入，但需要群主或管理员审批。
    const GROUP_PUBLIC = 1;
    // 群组类型：临时会议群 适合跟 TRTC 结合实现视频会议和在线教育等场景，支持随意进出，支持查看进群前的历史消息。
    const GROUP_MEETING = 2;
    // 群组类型：直播群 适合直播弹幕聊天室等场景，支持随意进出，人数无上限。
    const GROUP_AVCHATROOM = 3;
}
